{
  "title": "Keshava Nama",
  "metadata": {
    "chapters": 1,
    "totalLines": 10,
    "languages": ["deva", "knda", "tel", "tam", "pan", "guj", "iast"],
    "practiceMode": true,
    "puzzleMode": true,
    "composer": "Kanaka Dasaru"
  },
  "sources": {
    "iast": "https://vignanam.org/english/keshava-nama.html",
    "deva": "https://vignanam.org/devanagari/keshava-nama.html",
    "knda": "https://vignanam.org/kannada/keshava-nama.html",
    "tel": "https://vignanam.org/telugu/keshava-nama.html",
    "tam": "https://vignanam.org/tamil/keshava-nama.html",
    "pan": "https://vignanam.org/punjabi/keshava-nama.html",
    "guj": "https://vignanam.org/gujarati/keshava-nama.html"
  },
  "lines": [
    {
      "id": "1",
      "deva": "केशव नाम",
      "iast": "Keshava Nama",
      "knda": "ಕೇಶವ ನಾಮ",
      "tel": "కేశవ నామ",
      "tam": "கேஶவ நாம",
      "pan": "ਕੇਸ਼ਵ ਨਾਮ",
      "guj": "કેશવ નામ",
      "meaning": "",
      "chapter": "Keshava Nama"
    },
    {
      "id": "2",
      "deva": "ईश निन्न चरण भजने आशेयिंद माडुवेनु दोष राशि नाश माडु श्रीश केशव",
      "iast": "īśa ninna charaṇa bhajane āśeyinda māḍuvenu dōṣa rāśi nāśa māḍu śrīśa kēśava",
      "knda": "ಈಶ ನಿನ್ನ ಚರಣ ಭಜನೆ ಆಶೆಯಿಂದ ಮಾಡುವೆನು ದೋಷ ರಾಶಿ ನಾಶ ಮಾಡು ಶ್ರೀಶ ಕೇಶವ",
      "tel": "ఈశ నిన్న చరణ భజనె ఆశెయింద మాడువెను దోష రాశి నాశ మాడు శ్రీశ కేశవ",
      "tam": "ஈஶ நின்ன சரண பஜ⁴னெ ஆஶெயிந்த³ மாடு³வெனு தோ³ஷ ராஶி நாஶ மாடு³ ஶ்ரீஶ கேஶவ",
      "pan": "ਈਸ਼ ਨਿਨ੍ਨ ਚਰਣ ਭਜਨੇ ਆਸ਼ੇਯਿਂਦ ਮਾਡੁਵੇਨੁ ਦੋਸ਼ ਰਾਸ਼ਿ ਨਾਸ਼ ਮਾਡੁ ਸ਼੍ਰੀਸ਼ ਕੇਸ਼ਵ",
      "guj": "ઈશ નિન્ન ચરણ ભજને આશેયિંદ માડુવેનુ દોષ રાશિ નાશ માડુ શ્રીશ કેશવ",
      "meaning": ""
    },
    {
      "id": "3",
      "deva": "शरणु होक्केनय्य एन्न मरण समयदल्लि निन्न चरण स्मरणे करुणिसय्य नाराయण",
      "iast": "śaraṇu hokkenayya enna maraṇa samayadalli ninna charaṇa smaraṇe karuṇisayya nārāyaṇa",
      "knda": "ಶರಣು ಹೊಕ್ಕೆನಯ್ಯ ಎನ್ನ ಮರಣ ಸಮಯದಲ್ಲಿ ನಿನ್ನ ಚರಣ ಸ್ಮರಣೆ ಕರುಣಿಸಯ್ಯ ನಾರಾಯಣ",
      "tel": "శరణు హొక్కెనయ్య ఎన్న మరణ సమయదల్లి నిన్న చరణ స్మరణె కరుణిసయ్య నారాయణ",
      "tam": "ஶரணு ஹொக்கெனய்ய என்ன மரண ஸமயத³ல்லி நின்ன சரண ஸ்மரணெ கருணிஸய்ய நாராயண",
      "pan": "ਸ਼ਰਣੁ ਹੋਕ੍ਕੇਨਯ੍ਯ ਏਨ੍ਨ ਮਰਣ ਸਮਯਦਲ੍ਲਿ ਨਿਨ੍ਨ ਚਰਣ ਸ੍ਮਰਣੇ ਕਰੁਣਿਸਯ੍ਯ ਨਾਰਾਯਣ",
      "guj": "શરણુ હોક્કેનય્ય એન્ન મરણ સમયદલ્લિ નિન્ન ચરણ સ્મરણે કરુણિસય્ય નારાયણ",
      "meaning": ""
    },
    {
      "id": "4",
      "deva": "शोधिसेन्न भवद कलुष बोधिसय्य ज्ञानवेनगे बाधिसुवा यमन बाधे बिडिसु माधव",
      "iast": "śōdhisenna bhavada kaluṣa bōdhisayya jñānavenage bādhisuvā yamana bādhe biḍisu mādhava",
      "knda": "ಶೋಧಿಸೆನ್ನ ಭವದ ಕಲುಷ ಬೋಧಿಸಯ್ಯ ಜ್ಞಾನವೆನಗೆ ಬಾಧಿಸುವಾ ಯಮನ ಬಾಧೆ ಬಿಡಿಸು ಮಾಧವ",
      "tel": "శోధిసెన్న భవద కలుష బోధిసయ్య జ్ఞానవెనగె బాధిసువా యమన బాధె బిడిసు మాధవ",
      "tam": "ஶோதி⁴ஸென்ன ப⁴வத³ கலுஷ போ³தி⁴ஸய்ய ஜ்ஞானவெனகெ³ பா³தி⁴ஸுவா யமன பா³தெ⁴ பி³டி³ஸு மாத⁴வ",
      "pan": "ਸ਼ੋਧਿਸੇਨ੍ਨ ਭਵਦ ਕਲੁਸ਼ ਬੋਧਿਸਯ੍ਯ ਜ੍ਞਾਨਵੇਨਗੇ ਬਾਧਿਸੁਵਾ ਯਮਨ ਬਾਧੇ ਬਿਡਿਸੁ ਮਾਧਵ",
      "guj": "શોધિસેન્ન ભવદ કલુષ બોધિસય્ય જ્ઞાનવેનગે બાધિસુવા યમન બાધે બિડિસુ માધવ",
      "meaning": ""
    },
    {
      "id": "5",
      "deva": "हिंदनेक योनिगळलि बंदु बंदु नोंदे नानु इंदु भवद बंध बिडिसु तंदे गोविंदने",
      "iast": "hindanēka yōnigaḻali bandu bandu nonde nānu indu bhavada bandha biḍisu tande gōvindane",
      "knda": "ಹಿಂದನೇಕ ಯೋನಿಗಳಲಿ ಬಂದು ಬಂದು ನೊಂದೆ ನಾನು ಇಂದು ಭವದ ಬಂಧ ಬಿಡಿಸು ತಂದೆ ಗೋವಿಂದನೆ",
      "tel": "హిందనేక యోనిగళలి బందు బందు నొందె నాను ఇందు భవద బంధ బిడిసు తందె గోవిందనె",
      "tam": "ஹிந்த³னேக யோனிகள³லி ப³ந்து³ ப³ந்து³ நொந்தெ³ நானு இந்து³ ப⁴வத³ ப³ந்த⁴ பி³டி³ஸு தந்தெ³ கோ³விந்த³னெ",
      "pan": "ਹਿਂਦਨੇਕ ਯੋਨਿਗਲ਼ਲਿ ਬਂਦੁ ਬਂਦੁ ਨੋਂਦੇ ਨਾਨੁ ਇਂਦੁ ਭਵਦ ਬਂਧ ਬਿਡਿਸੁ ਤਂਦੇ ਗੋਵਿਂਦਨੇ",
      "guj": "હિંદનેક યોનિગળલિ બંદુ બંદુ નોંદે નાનુ ઇંદુ ભવદ બંધ બિડિસુ તંદે ગોવિંદને",
      "meaning": ""
    },
    {
      "id": "6",
      "deva": "भ्रष्टनेनिस बेड कृष्ण इष्टु मात्र बेडिकोंबे शिष्टरोळगे इट्टु कष्ट बिडिसु विष्णुवे",
      "iast": "bhraṣṭanenisa bēḍa kṛṣṇa iṣṭu mātra bēḍikombe śiṣṭaroḻage iṭṭu kaṣṭa biḍisu viṣṇuve",
      "knda": "ಭ್ರಷ್ಟನೆನಿಸ ಬೇಡ ಕೃಷ್ಣ ಇಷ್ಟು ಮಾತ್ರ ಬೇಡಿಕೊಂಬೆ ಶಿಷ್ಟರೊಳಗೆ ಇಟ್ಟು ಕಷ್ಟ ಬಿಡಿಸು ವಿಷ್ಣುವೆ",
      "tel": "భ్రష్టనెనిస బేడ కృష్ణ ఇష్టు మాత్ర బేడికొంబె శిష్టరొళగె ఇట్టు కష్ట బిడిసు విష్ణువె",
      "tam": "ப்⁴ரஷ்டனெனிஸ பே³ட³ க்ருஷ்ண இஷ்டு மாத்ர பே³டி³கொம்பெ³ ஶிஷ்டரொளகெ³ இட்டு கஷ்ட பி³டி³ஸு விஷ்ணுவெ",
      "pan": "ਭ੍ਰਸ਼੍ਟਨੇਨਿਸ ਬੇਡ ਕ੍ਰੁਰੁਇਸ਼੍ਣ ਇਸ਼੍ਟੁ ਮਾਤ੍ਰ ਬੇਡਿਕੋਂਬੇ ਸ਼ਿਸ਼੍ਟਰੋਲ਼ਗੇ ਇਟ੍ਟੁ ਕਸ਼੍ਟ ਬਿਡਿਸੁ ਵਿਸ਼੍ਣੁਵੇ",
      "guj": "ભ્રષ્ટનેનિસ બેડ કૃષ્ણ ઇષ્ટુ માત્ર બેડિકોંબે શિષ્ટરોળગે ઇટ્ટુ કષ્ટ બિડિસુ વિષ્ણુવે",
      "meaning": ""
    },
    {
      "id": "7",
      "deva": "मोदलु निन्न पाद पूजे मुददि गैवेनय्य नानु हृदयदोळगे ओदगिसय्य मधुसूदन",
      "iast": "modalu ninna pāda pūje mudadi gaivenayya nānu hṛdayadoḻage odagisayya madhusūdana",
      "knda": "ಮೊದಲು ನಿನ್ನ ಪಾದ ಪೂಜೆ ಮುದದಿ ಗೈವೆನಯ್ಯ ನಾನು ಹೃದಯದೊಳಗೆ ಒದಗಿಸಯ್ಯ ಮಧುಸೂದನ",
      "tel": "మొదలు నిన్న పాద పూజె ముదది గైవెనయ్య నాను హృదయదొళగె ఒదగిసయ్య మధుసూదన",
      "tam": "மொத³லு நின்ன பாத³ பூஜெ முத³தி³ கை³வெனய்ய நானு ஹ்ருத³யதொ³ளகெ³ ஒத³கி³ஸய்ய மது⁴ஸூத³ன",
      "pan": "ਮੋਦਲੁ ਨਿਨ੍ਨ ਪਾਦ ਪੂਜੇ ਮੁਦਦਿ ਗੈਵੇਨਯ੍ਯ ਨਾਨੁ ਹ੍ਰੁਰੁਇਦਯਦੋਲ਼ਗੇ ਓਦਗਿਸਯ੍ਯ ਮਧੁਸੂਦਨ",
      "guj": "મોદલુ નિન્ન પાદ પૂજે મુદદિ ગૈવેનય્ય નાનુ હૃદયદોળગે ઓદગિસય્ય મધુસૂદન",
      "meaning": ""
    },
    {
      "id": "8",
      "deva": "कविदुकोंडु इरुव पाप सवेदु होगुवंते माडि जवन बाधेयन्नु बिडिसो घन त्रिविक्रम",
      "iast": "kavidukoṇḍu iruva pāpa savedu hōguvante māḍi javana bādheyanu biḍiso ghana trivikrama",
      "knda": "ಕವಿದುಕೊಂಡು ಇರುವ ಪಾಪ ಸವೆದು ಹೋಗುವಂತೆ ಮಾಡಿ ಜವನ ಬಾಧೆಯನ್ನು ಬಿಡಿಸೊ ಘನ ತ್ರಿವಿಕ್ರಮ",
      "tel": "కవిదుకొండు ఇరువ పాప సవెదు హోగువంతె మాడి జవన బాధెయన్ను బిడిసొ ఘన త్రివిక్రమ",
      "tam": "கவிது³கொண்டு³ இருவ பாப ஸவெது³ ஹோகு³வந்தெ மாடி³ ஜவன பா³தெ⁴யன்னு பி³டி³ஸொ க⁴ன த்ரிவிக்ரம",
      "pan": "ਕਵਿਦੁਕੋਂਡੁ ਇਰੁਵ ਪਾਪ ਸਵੇਦੁ ਹੋਗੁਵਂਤੇ ਮਾਡਿ ਜਵਨ ਬਾਧੇਯਨ੍ਨੁ ਬਿਡਿਸੋ ਘਨ ਤ੍ਰਿਵਿਕ੍ਰਮ",
      "guj": "કવિદુકોંડુ ઇરુવ પાપ સવેદુ હોગુવંતે માડિ જવન બાધેયન્નુ બિડિસો ઘન ત્રિવિક્રમ",
      "meaning": ""
    },
    {
      "id": "9",
      "deva": "कामजनक निन्न नाम प्रेमदिंद पाडुवंथ नेमवेनगे पालिसय्य स्वामि वामन",
      "iast": "kāmajanaka ninna nāma prēmadinda pāḍuvantha nēmavenage pālisayya svāmi vāmana",
      "knda": "ಕಾಮಜನಕ ನಿನ್ನ ನಾಮ ಪ್ರೇಮದಿಂದ ಪಾಡುವಂಥ ನೇಮವೆನಗೆ ಪಾಲಿಸಯ್ಯ ಸ್ವಾಮಿ ವಾಮನ",
      "tel": "కామజనక నిన్న నామ ప్రేమదింద పాడువంథ నేమవెనగె పాలిసయ్య స్వామి వామన",
      "tam": "காமஜனக நின்ன நாம ப்ரேமதி³ந்த³ பாடு³வந்த² நேமவெனகெ³ பாலிஸய்ய ஸ்வாமி வாமன",
      "pan": "ਕਾਮਜਨਕ ਨਿਨ੍ਨ ਨਾਮ ਪ੍ਰੇਮਦਿਂਦ ਪਾਡੁਵਂਥ ਨੇਮਵੇਨਗੇ ਪਾਲਿਸਯ੍ਯ ਸ੍ਵਾਮਿ ਵਾਮਨ",
      "guj": "કામજનક નિન્ન નામ પ્રેમદિંદ પાડુવંથ નેમવેનગે પાલિસય્ય સ્વામિ વામન",
      "meaning": ""
    },
    {
      "id": "10",
      "deva": "मदननय्य निन्न महिमे वदनदल्लि इरुव हागे हृदयदल्लि सदन माडु मुददि श्रीधर",
      "iast": "madananayya ninna mahime vadanadalli iruva hāge hṛdayadalli sadana māḍu mudadi śrīdhara",
      "knda": "ಮದನನಯ್ಯ ನಿನ್ನ ಮಹಿಮೆ ವದನದಲ್ಲಿ ಇರುವ ಹಾಗೆ ಹೃದಯದಲ್ಲಿ ಸದನ ಮಾಡು ಮುದದಿ ಶ್ರೀಧರ",
      "tel": "మదననయ్య నిన్న మహిమె వదనదల్లి ఇరువ హాగె హృదయదల్లి సదన మాడు ముదది శ్రీధర",
      "tam": "மத³னநய்ய நின்ன மஹிமெ வத³னத³ல்லி இருவ ஹாகெ³ ஹ்ருத³யத³ல்லி ஸத³ன மாடு³ முத³தி³ ஶ்ரீத⁴ர",
      "pan": "ਮਦਨਨਯ੍ਯ ਨਿਨ੍ਨ ਮਹਿਮੇ ਵਦਨਦਲ੍ਲਿ ਇਰੁਵ ਹਾਗੇ ਹ੍ਰੁਰੁਇਦਯਦਲ੍ਲਿ ਸਦਨ ਮਾਡੁ ਮੁਦਦਿ ਸ਼੍ਰੀਧਰ",
      "guj": "મદનનય્ય નિન્ન મહિમે વદનદલ્લિ ઇરુવ હાગે હૃદયદલ્લિ સદન માડુ મુદદિ શ્રીધર",
      "meaning": ""
    }
  ]
}
